modm-ext/archive-stmicro-svd/rm_rm0440_stm32g431c6t6.svd
      <register>
        <name>AF1</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BKINE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP1E</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP2E</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP3E</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP4E</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP5E</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP6E</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP7E</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP8E</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKINP</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP1P</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP2P</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP3P</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BKCMP4P</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AF2</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>OCRSEL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OR1</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HSE32EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>1</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DCR</name>
        <addressOffset>0x3dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DBA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
          <field>
            <name>DBL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DMAR</name>
        <addressOffset>0x3e0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DMAB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>TIM20</name>
      <baseAddress>0x40015000</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UDIS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>URS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OPM</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>28</bitWidth>
          </field>
          <field>
            <name>ARPE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>UIFREMA</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DITHEN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR2</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>MMS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIER</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UIE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>1</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
          <field>
            <name>UDE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>1</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EGR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>UG</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>1</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CNT</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CNT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>15</bitWidth>
          </field>
          <field>
            <name>UIFCPYs</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PSC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PSC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ARR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ARR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>SAI1</name>
      <baseAddress>0x40015400</baseAddress>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MODE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PRTCFG</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>28</bitWidth>
          </field>
          <field>
            <name>DS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>LSBFIRST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKSTR</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNCEN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MONO</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OUTDRIV</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SAIEN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAEN</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NODIV</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCKDIV</name>
            <bitOffset>20</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>OSR</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCKEN</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FTH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>FFLUS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRIS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTEVAL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTECN</name>
            <bitOffset>7</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>CPL</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMP</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FRL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>FSALL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>15</bitOffset>
            <bitWidth>17</bitWidth>
          </field>
          <field>
            <name>FSDEF</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FSPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FSOFF</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FBOFF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>SLOTSZ</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NBSLOT</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SLOTEN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IMA</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OVRUDRIE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTEDETIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WCKCFGIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FREQIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNRDYIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AFSDETIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LFSDETIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OVRUDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTEDET</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WCKCFG</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FREQ</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CNRDY</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AFSDET</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LFSDET</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>7</bitOffset>
            <bitWidth>25</bitWidth>
          </field>
          <field>
            <name>FLVL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>COVRUDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CMUTEDET</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CWCKCFG</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>3</bitOffset>
            <bitWidth>29</bitWidth>
          </field>
          <field>
            <name>CCNRDY</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAFSDET</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLFSDET</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MODE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PRTCFG</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>28</bitWidth>
          </field>
          <field>
            <name>DS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>LSBFIRST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKSTR</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SYNCEN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MONO</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OUTDRIV</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SAIEN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAEN</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NODIV</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCKDIV</name>
            <bitOffset>20</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>OSR</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MCKEN</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FTH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>FFLUS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TRIS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTEVAL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MUTECN</name>
            <bitOffset>7</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>CPL</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COMP</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FRL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>FSALL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>15</bitOffset>
            <bitWidth>17</bitWidth>
          </field>
          <field>
            <name>FSDEF</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FSPOL</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FSOFF</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
