modm-ext/archive-stmicro-svd/rm_rm0440_stm32g431c6t6.svd
      <register>
        <name>ODISR</name>
        <addressOffset>0x398</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TA1ODIS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TA2ODIS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TB1ODIS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TB2ODIS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC1ODIS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC2ODIS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TD1ODIS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TD2ODIS</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TE1ODIS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TE2ODIS</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TF1ODIS</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TF2ODIS</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ODSR</name>
        <addressOffset>0x39c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TA1ODS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TA2ODS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TB1ODS</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TB2ODS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC1ODS</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TC2ODS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TD1ODS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TD2ODS</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TE1ODS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TE2ODS</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TF1ODS</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TF2ODS</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BMCR</name>
        <addressOffset>0x3a0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BME</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BMOM</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BMCLK</name>
            <bitOffset>2</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BMPRSC</name>
            <bitOffset>6</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BMPREN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>11</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>MTBM</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TABM</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBBM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCBM</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TDBM</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEBM</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TFBM</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BMSTAT</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BMTRG</name>
        <addressOffset>0x3a4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTRST</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTREP</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTCMP1</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTCMP2</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTCMP3</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MSTCMP4</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TARST</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TAREP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TACMP1</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TACMP2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBRST</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBREP</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBCMP1</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TBCMP2</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCRST</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCREP</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCCMP1</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TFRST</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TDRST</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TDREP</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TFREP</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TDCMP2</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TFCMP1</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEREP</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TECMP1</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TECMP2</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TAEEV7</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TDEEV8</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EEV7</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EEV8</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OCHPEV</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BMCMPR</name>
        <addressOffset>0x3a8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BMCMP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BMPER</name>
        <addressOffset>0x3ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BMPER</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EECR1</name>
        <addressOffset>0x3b0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EE1SRC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE1POL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE1SNS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE1FAST</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE2SRC</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE2POL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE2SNS</name>
            <bitOffset>9</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE2FAST</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE3SRC</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE3POL</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE3SNS</name>
            <bitOffset>15</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE3FAST</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE4SRC</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE4POL</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE4SNS</name>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE4FAST</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE5SRC</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE5POL</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE5SNS</name>
            <bitOffset>27</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE5FAST</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EECR2</name>
        <addressOffset>0x3b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EE6SRC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE6POL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE6SNS</name>
            <bitOffset>3</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>5</bitOffset>
            <bitWidth>27</bitWidth>
          </field>
          <field>
            <name>EE7SRC</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE7POL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE7SNS</name>
            <bitOffset>9</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE8SRC</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE8POL</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE8SNS</name>
            <bitOffset>15</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE9SRC</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE9POL</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE9SNS</name>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE10SRC</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>EE10POL</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EE10SNS</name>
            <bitOffset>27</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>EECR3</name>
        <addressOffset>0x3b8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EE6F</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
          <field>
            <name>EE7F</name>
            <bitOffset>6</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EE8F</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EE9F</name>
            <bitOffset>18</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EE10F</name>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>EEVSD</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ADC1R</name>
        <addressOffset>0x3bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADC1MC1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1MC2</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1MC3</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1MC4</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1MPER</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1EEV1</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1EEV2</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1EEV3</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1EEV4</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1EEV5</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TFC2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TAC3</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TAC4</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TAPER</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TARST</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TFC3</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TBC3</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TBC4</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TBPER</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TBRST</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TFC4</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TCC3</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TCC4</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TCPER</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TFPER</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TDC3</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TDC4</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TDPER</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TFRST</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TEC3</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TEC4</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADC1TEPER</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
